ErpTest/src/DataProcessors/пкСозданиеПроверкиИсков/пкСозданиеПроверкиИсков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>пкСозданиеПроверкиИсков</name>
  <comment>Рарус</comment>
  <attributes>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.ВнешниеПользователи</types>
      <types>CatalogRef.РолиИсполнителей</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокИсполнения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Проверяющий</name>
    <type>
      <types>CatalogRef.ВнешниеПользователи</types>
      <types>CatalogRef.РолиИсполнителей</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокПроверки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДанныеОбработки</name>
    <attributes>
      <name>Иск</name>
      <type>
        <types>DocumentRef.пкСудебныйИск</types>
      </type>
    </attributes>
    <attributes>
      <name>БП_Согласования</name>
      <type>
        <types>BusinessProcessRef</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗадачаПоПроверке</name>
      <type>
        <types>TaskRef</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

ErpTest/src/Documents/пкСудебныйИск/пкСудебныйИск.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>пкСудебныйИск</name>
  <basedOn>Document.пкПретензия</basedOn>
  <registerRecords>InformationRegister.пкПретензииПоСчетам</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>(Общ) Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.ВнешниеПользователи</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерДела</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Суд</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СодержаниеСпора</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.пкСтатусыСудебныхИсков</types>
    </type>
  </attributes>
  <attributes>
    <name>Претензия</name>
    <type>
      <types>DocumentRef.пкПретензия</types>
    </type>
  </attributes>
  <attributes>
    <name>Результат</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НаходитсяВРаботе</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДолгАренда</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>17</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДолгОборудование</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>17</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пени</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>17</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Госпошлина</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>17</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>17</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.пкСудебныйИск</types>
      <types>DocumentRef.пкПретензия</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Расшифровка</name>
    <attributes>
      <name>Событие</name>
      <type>
        <types>EnumRef.пкСобытияСудебныхИсков</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаСобытия</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПогашениеДолга</name>
    <attributes>
      <name>Счет</name>
      <type>
        <types>DocumentRef.ВозвратТоваровОтКлиента</types>
        <types>DocumentRef.ОтчетКомиссионера</types>
        <types>DocumentRef.ОтчетДавальцу</types>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
        <types>DocumentRef.ОтчетПоКомиссииМеждуОрганизациями</types>
        <types>DocumentRef.ЗаявкаНаВозвратТоваровОтКлиента</types>
        <types>DocumentRef.ОтчетКомитенту</types>
        <types>DocumentRef.РеализацияУслугПрочихАктивов</types>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
        <types>DocumentRef.ОтчетПоКомиссииМеждуОрганизациямиОСписании</types>
        <types>DocumentRef.ВыкупВозвратнойТарыКлиентом</types>
        <types>DocumentRef.АктВыполненныхРабот</types>
        <types>DocumentRef.ОтчетКомиссионераОСписании</types>
        <types>DocumentRef.ПередачаТоваровМеждуОрганизациями</types>
        <types>DocumentRef.ЗаказКлиента</types>
        <types>DocumentRef.ЗаказДавальца</types>
      </type>
    </attributes>
    <attributes>
      <name>Валюта</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСчета</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>17</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаЗадолженности</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>17</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОплат</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаОплат</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>17</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Остаток</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>17</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>История</name>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Статус</name>
      <type>
        <types>EnumRef.пкСтатусыСудебныхИсков</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ErpTest/src/DataProcessors/пкСозданиеПроверкиИсков/ObjectModule.bsl
Процедура НайтиИскиДляПроверки() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	пкСудебныйИск.Ссылка КАК Иск,
	               |	ЗадачаИсполнителя.Ссылка КАК ЗадачаПоПроверке,
	               |	ЗадачаИсполнителя.БизнесПроцесс КАК БП_Согласования
	               |ИЗ
	               |	Документ.пкСудебныйИск КАК пкСудебныйИск
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Задача.ЗадачаИсполнителя КАК ЗадачаИсполнителя
	               |		ПО пкСудебныйИск.Ссылка = ЗадачаИсполнителя.Предмет
	               |			И (ЗадачаИсполнителя.Выполнена = ЛОЖЬ)
	               |ГДЕ
	               |	пкСудебныйИск.Проведен = ИСТИНА
	               |	И пкСудебныйИск.НаходитсяВРаботе = ИСТИНА";
	
	Результат = Запрос.Выполнить();
	ДанныеОбработки.Загрузить(Результат.Выгрузить());

КонецПроцедуры

Процедура СоздатьЗадачиПроверки() Экспорт
	
	НачТекДата=НачалоДня(ТекущаяДата());
	
	Для каждого СтрокаИска Из ДанныеОбработки Цикл
		Если ЗначениеЗаполнено(СтрокаИска.ЗадачаПоПроверке) Тогда
			Продолжить;
		КонецЕсли; 	
		БПСогласования=БизнесПроцессы.Задание.СоздатьБизнесПроцесс();
	    БПСогласования.Заполнить(СтрокаИска.Иск);
		БПСогласования.СрокИсполнения=СрокИсполнения;
		Если ЗначениеЗаполнено(Исполнитель) Тогда
		БПСогласования.Исполнитель=Исполнитель;
		КонецЕсли;
		Если не ЗначениеЗаполнено(БПСогласования.Исполнитель) Тогда
		БПСогласования.Исполнитель=СтрокаИска.Иск.Ответственный;	
		КонецЕсли;
		Если не ЗначениеЗаполнено(БПСогласования.Исполнитель) Тогда
		БПСогласования.Исполнитель=Пользователи.АвторизованныйПользователь();	
		КонецЕсли;
		Если ЗначениеЗаполнено(Проверяющий) Тогда
			БПСогласования.НаПроверке=Истина;
			БПСогласования.Проверяющий=Проверяющий;
			БПСогласования.СрокПроверки=СрокПроверки;
		Иначе	
			БПСогласования.НаПроверке=Ложь;
			//БПСогласования.Проверяющий=Неопределено;
			//БПСогласования.СрокПроверки=Неопределено;
		КонецЕсли;
		БПСогласования.Содержание="Проверить статус документа "+Строка(СтрокаИска.Иск);
		БПСогласования.Наименование="Проверить статус документа "+Строка(СтрокаИска.Иск);
		БПСогласования.Дата=НачТекДата;
		БПСогласования.Записать();
		БПСогласования.Старт();
		СтрокаИска.БП_Согласования=БПСогласования.Ссылка;
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	ЗадачаИсполнителя.Ссылка
		|ИЗ
		|	Задача.ЗадачаИсполнителя КАК ЗадачаИсполнителя
		|ГДЕ
		|	ЗадачаИсполнителя.БизнесПроцесс = &БизнесПроцесс
		|	И ЗадачаИсполнителя.Выполнена = ЛОЖЬ";
		
		Запрос.УстановитьПараметр("БизнесПроцесс", БПСогласования.Ссылка);
		
		Результат = Запрос.Выполнить();
		Выборка = Результат.Выбрать();
		
		Если Выборка.Следующий() Тогда
			СтрокаИска.ЗадачаПоПроверке=Выборка.Ссылка;
		КонецЕсли;
		 
	КонецЦикла; 

КонецПроцедуры

СрокИсполнения=НачалоДня(ТекущаяДата())+5*24*60*60;
СрокПроверки=СрокИсполнения+5*24*60*60;
Исполнитель=Справочники.РолиИсполнителей.НайтиПоНаименованию("Юристы");
Если Не ЗначениеЗаполнено(Исполнитель) Тогда
Исполнитель=Справочники.РолиИсполнителей.НайтиПоНаименованию("Юрист");
КонецЕсли;
